[
  {
    "title": "Universal Controls LLC",
    "subheader": "Programmer",
    "summary": "6/2019 – 3/2020",
    "details": [
      "Software Development: services (.NET, Node.js, SQL, 3rd party APIs), web application (data dashboard, React, SQL), edge computing, programmable logic controllers, human-machine interfaces.",
      "Systems Administration: virtual private servers (web app, VPN server, SQL, Apache), Linux (Ubuntu Server, CentOS), network (office, VPN), single-board computers (configuration/deployment, services, databases, VPN).",
      "Database Administration: MySQL, MariaDB, cybersecurity (SSL/TLS), multi-source replication."
    ],
    "image": "assets/universal-controls.jpg"
  },
  {
    "title": "Design Center Colorado",
    "subheader": "Junior Systems Engineer Contract",
    "summary": "8/2018 – 5/2019",
    "details": [
      "On team of nine senior engineering students (CS + ME + EE), client was Siemens Gamesa Renewable Energy who invested over $15,000 towards the development of a damage/defect testing system for wind turbine blades. System was mounted on industry-grade drone to allow remote control.",
      "Worked with team and stakeholders to determine/define system requirements, researched available technology/solutions, developed prototype system, got client approval for design plan, developed software services/programs for single-board computer/controller (e.g. data buffering/logging, sensor IO), wrote technical documentation for developers and operators, interfaced computer with sensor modules (GPS, IMU, LIDAR) and IR camera, tested system/drone at NREL site, presented system at Senior Design Expo."
    ],
    "image": "assets/design-center-co.jpg",
    "links": [
      { "title": "Design Center Colorado", "url": "https://www.colorado.edu/designcenter/" },
      { "title": "Magazine Article", "url": "https://www.colorado.edu/mechanical/2019/04/22/siemens-gamesa-partners-cu-students-develop-drone-based-monitoring-system-wind-turbines" },
      { "title": "Siemens Gamesa", "url": "https://www.siemensgamesa.com/en-int" }
    ]
  },
  {
    "title": "West Safety Services",
    "subheader": "PC Technician",
    "summary": "11/2012 – 2/2014",
    "details": [
      "Responsible for installing, configuring, maintaining, troubleshooting, and repairing computer workstations and peripherals.",
      "Administered print servers, user account information and permissions, and security group memberships.",
      "Helped resolve networking issues such as physical connectivity, OS configuration and VPN security requirements.",
      "Migrated users from Windows XP to Windows 7."
    ],
    "image": "assets/west-safety-services.jpg"
  },
  {
    "title": "University of Colorado Boulder",
    "subheader": "IT Technician II",
    "summary": "8/2011 – 6/2012",
    "details": [
      "Provided Tier 2 desktop support for multiple departments at the University, acting as primary technician for the “Office of Information Technology” and “Accounting and Business Support” departments.",
      "Responsible for installing, configuring, maintaining, troubleshooting, and repairing computer workstations and peripherals.  Worked with 3rd party vendors to create quotes for new hardware and software.",
      "Trained staff at University workshops, created technical documentation.",
      "Administered print servers and user accounts (information, permissions, and security group memberships).",
      "Helped resolve networking issues such as physical connectivity, OS configuration and VPN security requirements.",
      "Migrated users from Windows XP to Windows 7"
    ],
    "image": "assets/cu-boulder.jpeg"
  },
  {
    "title": "Arizona State University",
    "subheader": "Support Systems Specialist",
    "summary": "8/2006 – 1/2011",
    "details": [
      "Provided Tier 2 IT support for the Global Institute of Sustainability (GIOS).  Responsible for designing/deploying computer images, managing user accounts and network file share permissions, and administrating Active Directory and Group policy.",
      "Resolved hardware, software, network, printer and smart-phone issues via phone, e-mail and in person.",
      "Successfully upgraded GIOS computers (100+ machines) from Windows XP/Office 2003 to Windows 7/Office 2010.",
      "Recommended and created quotes for new equipment based on user’s needs and requests.",
      "Worked with 3rd party vendors for warranty replacements."
    ],
    "image": "assets/arizona_state_university.jpg"
  },
  {
    "title": "Blue Ridge High School",
    "subheader": "Computer Administrator",
    "summary": "10/2003 – 3/2006",
    "details": [
      "Provided IT support for faculty and staff at the Junior High School, which included two computing labs, 14 lab teachers, 6 servers, 13 network printers, and 100+ computers.",
      "Responsible for creating and deploying system images, managing user accounts and administrating Active Directory and Group Policy.",
      "Resolved hardware, software, networking and printer issues via phone, email, remotely and in person."
    ],
    "image": "assets/blue-ridge-school-district.jpg"
  }
]
